{"0":{"Title":"Polls must not delay subsidy for drivers – senators","Author":"DJ Yap","Publication Date":"April 05, 2022","Content":"LIFELINE A jeepney driver shows his “Pantawid Pasada Program” card while waiting for passengers at a transport terminal on Visayas Avenue in Quezon City in this photo taken on March 16. —GRIG C. MONTEGRANDE\nMANILA, Philippines — Drivers and operators of buses, jeepneys, and tricycles cannot afford to wait until the end of the May elections to receive fuel subsidies from the government, Sen. Grace Poe said on Monday as she lamented the suspension of the financial assistance due to the public spending ban of the Commission on Elections (Comelec).\n“We cannot tell our people to hold on for relief until the elections are over. Hunger simply cannot wait,” the chair of the Senate public services committee said in a statement.\nADVERTISEMENT\n\n\n\n\n\n\nThe ban on election spending is in effect from March 25 until May 8, the eve of Election Day.\nPoe called on the Comelec to act swiftly on the appeal of the Land Transportation Franchising and Regulatory Board (LTFRB) for an exemption to allow the agency to resume distribution of cash aid to PUV (public utility vehicle) drivers and operators.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\n“Since the release of the P3-billion fund, not even half of the identified 377,000 beneficiaries received the assistance, which was handed out only for 10 days before the election ban took effect on March 25,” she said.\nThe LTFRB on Monday said it had given subsidies to 110,287 drivers hit by the fuel price crisis.\n\n\n\n\nIn March, the LTFRB started distributing P6,500 in fuel aid to some 264,578 qualified PUV drivers to help them cope with runaway fuel price hikes exacerbated by the ongoing Ukraine-Russia conflict.\nSo far, it has given subsidies to 109,080 jeepney drivers and 1,207 bus drivers.\nAt least 67,447 applications for subsidies are still being reviewed by the board, including those filed by 22,932 taxi drivers.\nAccording to LTFRB Executive Director Tina Cassion, they have yet to receive a list of beneficiaries from the Department of the Interior and Local Government regarding tricycle drivers who are qualified for the program.\nDecision this week\nPoe said the subsidy program must resume immediately.\nADVERTISEMENT\n\n\n\n\n\n\n“Our PUV drivers and operators have waited long for the cash aid that we have funded in the annual budget to bring succor to our people in times of distress,” she said.\nOn Monday, the Comelec said it would announce on Thursday whether it would exempt the government’s fuel subsidy program for PUV drivers and operators from the election ban on public spending.\nThe poll body took up the LTFRB’s request during its weekly policy meeting on March 30 and required the agency to submit documents to justify exempting the fuel subsidy program from the election ban on public spending.\n“This is undergoing study and by Wednesday (April 6) a recommendation will be submitted to the en banc (policy body),” Comelec Commissioner George Garcia said on Monday.\n“You can expect by Thursday (April 7), we will announce Comelec’s action on LTFRB’s request,” he said.\nIn a statement, Cassion said the LTFRB had already “presented justification on its application for exemption… amid the pressing need to complete the distribution of payouts amid high prices of fuel while assuring the poll body that said distribution will not be used for political gains.”\nThe board is also working on the production of at least 86,000 cards and other preparations for the remaining payables, she added.\nEarlier, the Comelec exempted the Office of the Vice President’s pandemic relief projects from the election spending ban.\nThe poll body last week also exempted certain projects of the Department of Social Welfare and Development, the Office of the Presidential Adviser on Peace, Reconciliation and Unity, and the provincial government of Davao de Oro.\nSmall relief\nMeanwhile, motorists got a reprieve this week as oil companies on Tuesday slightly decreased pump prices of petroleum products, a week after implementing a big-time hike.\n\n\nPrices of gasoline and diesel were cut by P2.30 and P1.85 a liter, respectively, while the cost of kerosene fell by P1.65 a liter.\nThis would be the second time this year that oil companies rolled back fuel prices. Prior to this week’s adjustment, diesel and gasoline prices had gone up by P27.85 and P18.30 a liter, respectively.\nOn the global scene, analysts said concerns over tight supply due to the Russia-Ukraine crisis and the Iran nuclear deal continued to linger despite some countries’ decision to draw oil from their strategic petroleum reserves.\nUS President Joe Biden has authorized the release of more than 180 million barrels of oil from the country’s emergency oil reserve for the next six months. Member countries of the International Energy Agency followed suit.\nThe price of Dubai crude—the Asian bellwether—remained at $110.89 a barrel as of Monday.\nAs oil prices remain high, the government has been asked to ease the impact of rising fuel prices on the country’s agriculture sector by suspending the imposition of the excise on oil. \nRosanna Contreras, president of Soccsksargen Federation of Fishing and Allied Industries Inc., on Monday pushed for the suspension of the excise on petroleum products to ease the burden of consecutive oil price hikes on fishermen. Fuel accounts for 60 to 70 percent of the total fishing cost.\nChester Warren Tan, president of the National Federation of Hog Farmers Inc., said the reprieve sought by agricultural producers was temporary.\n“What the industry is asking for is to cancel or lower the tax for three to four months to help us cope with rising fuel costs,” he added.\n—WITH A REPORT FROM JORDEENE B. LAGARE \nRELATED STORIES\n\n\n‘Hunger simply cannot wait,’ says Poe on suspended PUV subsidy distribution due to poll ban\nComelec ruling on LTFRB appeal for release of fuel subsidy out by Thursday\nFuel subsidy still unclaimed by many PUV drivers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nGov’t eyes new definition of ‘full vaccination’\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: fuel subsidy, Grace Poe, LTFRB, PUV drivers, rising fuel prices, Russia-Ukraine war\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"1":{"Title":"Gov’t eyes new definition of ‘full vaccination’","Author":"Jerome Aning","Publication Date":"April 05, 2022","Content":"Senior citizens in Parañaque City are inoculated with the CoronaVac vaccine at a shopping mall near Manila Bay. (File photo by RICHARD A. REYES \/ Philippine Daily Inquirer)\nMANILA, Philippines — The government is considering a redefinition of full vaccination to include the administration of a third dose or booster shot of the COVID-19 vaccine.\n“Today, when we say fully vaccinated, it means you have been inoculated with the primary doses. We are looking into the possibility of redefining it so that when we say fully vaccinated, it should include the booster shot, or you should have been inoculated thrice,” Interior Undersecretary for Operations Epimaco Densing III said at Monday’s Laging Handa briefing.\nADVERTISEMENT\n\n\n\n\n\n\nHe said one way for the new policy to be implemented was to set an expiration date on vaccination cards.\n“There’s this possibility that if you haven’t got your booster [shot] after six months [since your inoculation with the primary shots], your vaccination card will be automatically expired,” Densing said.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nVaccination sites, Densing said, will remain open to accept people who have not yet been administered either the primary or booster doses.\nSince local officials may be preoccupied with the election campaign, the Department of the Interior and Local Government is now coordinating with local health authorities to ensure the continuation of mass vaccination, he said.\n\n\n\n\nThe government may introduce a marketing campaign alongside the inoculation drive to convince more Filipinos to get vaccinated, Densing added.\nAccording to him, only around 12 million, mostly from Metro Manila, have availed themselves of booster shots, with the Bangsamoro Autonomous Region in Muslim Mindanao having the lowest vaccination coverage in the country.\nVirus case update\nThere were fewer new COVID-19 cases detected last week compared with the previous week, although this decline in new cases appears to have slowed down.\nThe Department of Health (DOH) reported in its weekly bulletin 2,679 new cases from March 28 to April 3, fewer by 47 cases than the 2,726 the previous week.\nLast week’s daily average of 382 new cases was 2 percent lower than the previous week’s average of 389.\nADVERTISEMENT\n\n\n\n\n\n\nThere were also fewer COVID-19 deaths reported last week, 329, compared with 752 the previous week.\nThe DOH confirmed 116 more deaths in March, 81 in February, 50 in January. The rest were recorded between March and December last year. \nThis pushed the death toll to 59,344 out of the 3.6 million coronavirus cases since the start of the pandemic.\n—WITH A REPORT FROM DONA Z. PAZZIBUGAN\nRELATED STORY\nExpert to DOH: Change definition of ‘fully vaxxed’\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nBoracay tourist arrivals reach record high in March\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: covid-19 vaccination, defintion of full vaccination, DoH, Epimaco Densing\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"2":{"Title":"Boracay tourist arrivals reach record high in March","Author":"Nestor P. Burgos Jr.","Publication Date":"April 05, 2022","Content":"SUMMER CROWD | Tourists take their spots on Boracay Island’s white beach on March 6, 2022, as hotels, restaurants and other establishments enjoy good business with the surge of visitors this month. (Photo by JACK JARILLA)\nILOILO CITY, Iloilo, Philippines — Tourist arrivals on Boracay Island reached 150,597 last month or a daily average of 4,858, the highest in two years since the COVID-19 pandemic was declared in March 2020.\nBut the number of foreign visitors remained low, more than a month after fully vaccinated tourists from visa-free countries were allowed to enter the Philippines.\nADVERTISEMENT\n\n\n\n\n\n\nMost of the visitors to the island — or 146,440 — were domestic tourists while Filipinos based overseas accounted for 1,624 of the total. Foreign tourists, who comprised at least half of the tourist arrivals on the island before the pandemic, numbered 2,533 or 1.68 percent.\nLast month’s tourist arrivals were only slightly lower than pre-pandemic figures — 160,070 in January 2020 and 103,834 in the following month — based on data from the tourism office of Malay town in Aklan province, which has jurisdiction over the island.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nCritical to recovery\nThe entry of more foreign visitors is considered critical to the recovery of Boracay’s economy as they generally stay longer and spend more when visiting the island, officials said.\nLast month, most of the foreign visitors were from the United States (603), followed by the United Kingdom (211), United Arab Emirates (201), Germany (161) and Canada (137).\n\n\n\n\nCouncilor Nenette Aguirre-Graf, chair of the Malay municipal council’s tourism committee, said that travel restrictions and quarantine requirements in Hong Kong and China were hindering the arrival of more tourists from these countries, two of Boracay’s main tourist markets.\nKorean market tapped\nGraf added that they expected more Korean tourists to visit the island in the coming months.\nThe Department of Tourism (DOT) earlier reported that foreign tourist arrivals in the Philippines reached 102,031 as of March 16.\n“We are happy to see the gradual reopening of our borders finally bearing fruit as evidenced by the much higher foreign visitor arrivals. This will help safeguard the industry’s revival, providing more jobs and livelihoods to Filipinos in the tourism sector,” Tourism Secretary Bernadette Romulo Puyat said in a statement.\nPuyat met with Korean tourism stakeholders in Seoul last week as part of the DOT’s effort to boost arrivals from the East Asian country.\nADVERTISEMENT\n\n\n\n\n\n\n“The Philippines is more than ready to welcome our Korean tourists. Our entry requirements are one of the safest and most relaxed in Asia,” she said.\n“It is understandable that some may still be reluctant to travel amid the pandemic but let me reassure you that the Philippine government and tourism industry have instituted measures to keep everyone safe,” Puyat added.\nBefore the pandemic, South Korea was the Philippines’ biggest tourist market with 1.98 million visitors in 2019.\nSince February this year, only 5,551 South Koreans have arrived in the country, the DOT said.\nPuyat, in a radio interview, said that more South Korean airline carriers were planning chartered flights to the Philippines.\nShe said that many Koreans were keen on visiting popular tourist destinations like Cebu, Boracay and the Clark Freeport.\nPuyat led the DOT delegation which met with Korean tour operators like Kyowon KRT, Modu Tours and Hana Tours and representatives of government agencies like the Ministries of Foreign Affairs, Trade, Industry and Energy.\nThe Philippine delegation also met with representatives from the aviation industry, including Philippine Airlines, Cebu Pacific, Asiana, Air Seoul, T’way, Jin Air, Jeju Air and Fly Gangwon.\nPuyat pitched the Philippines’ newest tourism products and activities that would likely appeal to the Korean travel market in the new normal. \nAccording to her, these included travel products and experiences that highlight culinary, history, nature, wellness and farm tourism.\n\n\nShe also informed Korean tourism officials and executives of the DOT’s “It’s More Fun with You” campaign aimed at welcoming back foreign visitors to the Philippines.\n“In this campaign, we highlight the preparations that our tourism industry has carried out while travel was put on hold. We will also feature the exciting destinations to visit, activities to experience, and culinary wonders to try. We have missed you; our destinations have also missed you, and the Philippines would certainly be more fun if you come and visit us,” Puyat said.\n—WITH A REPORT FROM TINA G. SANTOS\nRELATED STORIES\nBoracay tourist arrivals hitting prepandemic mark\nBoracay businesses see better times as PH relaxes tourists’ entry\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPresidential bets vow to make rights body stronger\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Boracay tourist arrivals, COVID-19 travel restrictions\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"3":{"Title":"Presidential bets vow to make rights body stronger","Author":"Krixia Subingsubing","Publication Date":"April 05, 2022","Content":"SO WE MAY NEVER FORGET | Portraits of survivors of martial law, taken by documentary photographer Rick Rocamora, are displayed at the University of the Philippines’ Diliman campus to remind the public of human rights violations under the regime of dictator Ferdinand Marcos. (Photo by NIÑO JESUS ORBETA \/ Philippine Daily Inquirer)\nMANILA, Philippines — After a full presidential term — the entirety of President Rodrigo Duterte’s administration — of being alternately disregarded and attacked, the Commission on Human Rights (CHR) may get the priority it deserves in government, if any among the nine candidates present in Sunday’s presidential debate is elected and fulfills their unanimous promise to strengthen the commission.\nOn Monday, lawyer Jacqueline de Guia, CHR spokesperson, said the commission welcomed the candidates’ pledge to help it fulfill its mandate of protecting human rights.\nADVERTISEMENT\n\n\n\n\n\n\nShe expressed the hope that their promise would “translate into a commitment that respect for human rights will be an important facet of future actions, policies and overall governance” of the next administration.\n“For the past years, we were operating on a limited budget and personnel—not to mention gaps in cooperation—yet we continue[d] to fulfill our mandate to the best of our abilities,” De Guia told the Inquirer when reached for comment.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\n“We hope that these statements of support affirm the importance of upholding human rights and dignity for all,” she added.\nAt Sunday’s debate hosted by the Commission on Elections, the candidates agreed to increase the CHR’s budget, which was once threatened by a vicious 2017 campaign at the House of Representatives to slash it down to P1,000, in response to the agency’s criticism and monitoring of the drug war.\n\n\n\n\nThen Speaker Pantaleon Alvarez also threatened to completely defund the CHR, claiming that it “[did] not do its job.”\nMr. Duterte vetoed in January the establishment of the Human Rights Institute from the CHR’s 2022 budget, citing the lack of a specific appropriation for that purpose.\nSen. Panfilo Lacson, who is one of the foremost champions of the CHR and who lobbied for a P678-million budget for the agency, said raising that budget would allow the commission to more effectively carry out its mandate to uphold human rights under the 1987 Constitution.\nManila Mayor Francisco “Isko Moreno” Domagoso said that, if elected president, he would make sure to give the commission “ample funding” so it can continue its work in investigating human rights abuses, while it also promotes respect for other fundamental rights to food, water, decent housing and quality of life.\nVice President Leni Robredo said this might be the reason why people had a poor understanding of human rights, because they think it was “malayo sa bituka” (far from the gut).\nADVERTISEMENT\n\n\n\n\n\n \nFormer Defense Secretary Norberto Gonzales noted that the CHR “was put in a very difficult position” under the Duterte administration and suggested that it might be time to assess whether there was a need to increase its authority.\nFor presidential candidate Jose Montemayor Jr., this could mean giving the commission quasijudicial powers, as opposed to its limited mandate of receiving evidence and conducting fact-finding inquiries.\nOnly Ferdinand Marcos Jr. was absent, once again, in the latest debate. The son and namesake of the late dictator remains the front-runner in presidential surveys.\n—WITH INQUIRER RESEARCH\nRELATED STORIES\nCHR to pursue Human Rights Institute despite veto\nCHR upset over Duterte veto of Human Rights Institute in 2022 nat’l budget\nDuterte vetoes establishment of CHR’s Human RIghts Institute from 2022 budget\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPAREx environmental study suspected to have been copied\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 presidential candidates, Comelec presidential debate, Commission on Human Rights\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"4":{"Title":"PAREx environmental study suspected to have been copied","Author":"Tyrone Jasper C. Piad","Publication Date":"April 05, 2022","Content":"INQUIRER FILE PHOTO\nMANILA, Philippines — A private sector-led campaign against San Miguel Corp.’s (SMC) proposed Pasig River Expressway (PAREx) alleged that some parts of the road project’s environmental impact statement (EIS) appeared to have been copied from other reports, thus casting doubts as to whether a proper assessment was conducted in the first place.\nIn a letter dated March 29 and addressed to the Environmental Management Bureau (EMB) of the Department of Environment and National Resources (DENR), #NoToPAREX campaign representative Joven Jacolbia asked the EMB to “look into possible incidents of misconduct and irregular practice in the preparation of the draft EIS” by the RHR Consulting Services on the 19.27-kilometer PAREx project.\nADVERTISEMENT\n\n\n\n\n\n\nThe Inquirer sought comments but SMC has yet to reply.\nThe group said it had identified sections of the PAREx EIS that “appear to have been lifted almost wholly” from other reports.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nThe Toll Regulatory Board, in a letter dated April 1 sent to representatives of the Ramon Ang-led conglomerate, asked SMC to comment on the matter.\nAmong the sections that appear to be copied were the Changes on Local Micro-Climate.\n\n\n\n\nJacolbia said it was “nearly identical” to an EIS report for the Makati Public Rail Transport System in 2019. He noted that words like “railway track” and “railway car” were even in the PAREx report, which signals that this section was “cut and paste” from other documents.\nThe same was observed in the PAREx EIS section on greenhouse gas mitigation measures, Jacolbia said. It was almost “identical” to a section in the Environmental Performance Report and Management Plan for the 7×55 MW Circulating Fluidized Bed Combustion Coal-fired Power Plant Expansion Project in Misamis Oriential in 2017.\nIn addition, the group noted that “several paragraphs” in Section 1.5 on Project Components of the PAREx report were “nearly identical” to some parts of Cavite-Laguna Expressway’s EIS.\n“If EMB can verify that such sections were indeed ‘lifted’ from other documents, such practices may be a strong indication that the project proponent, SMC Infrastructure, and its consultant, RHR Consulting Services Inc., may not have carried out the Environmental Impact Assessment with the rigor, diligence and integrity that EMB and the Filipino people expect, as required in the DENR Administrative Order No. 2003-30 Sec 1.c,” Jacolbia said.\n“It may also constitute theft of intellectual property, malpractice and violation of professional codes that should be acted upon by DENR-EMB and other concerned agencies,” he added.\nADVERTISEMENT\n\n\n\n\n\n\nThe Intramuros Administration (IA) also informed the DENR-EMB that it was not consulted about the project prior to the public hearing last month.\n“PAREx, if situated along the banks of the Pasig River adjacent to the boundaries of Intramuros, may affect the structural integrity as well as archeological excavations” of Intramuros Fortifications, Fort Santiago, Intendencia (Aduana) Building, Bureau of Immigration Building and National Press Club Building,” the IA pointed out.\nThus, the IA said it was “imperative that the proponents diligently and truthfully conduct the required Heritage Impact Assessment and Archeological Impact Assessment,” apart from the environmental impact assessment.\nRELATED STORY \nScientists join opposition against Pasig River Expressway project\nPAREx to cut travel time from 2 hours to 15 minutes\nSMC to revive Pasig River as part of P95 billion PAREX project\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nSenate to probe P203-B Marcos estate tax debts\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Parex environmental study, SMC, Toll Regulatory Board\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"5":{"Title":"Senate to probe P203-B Marcos estate tax debts","Author":"Melvin Gascon","Publication Date":"April 05, 2022","Content":"Facade of the Senate of the Philippines building. FILE PHOTO\nROMBLON, Romblon, Philippines — The Senate investigation of the P203-billion estate tax liabilities of the Marcos family will start this week, should any of the senators and the concerned committee press the issue, Senate President Vicente Sotto III said on Monday.\nSotto said he would confer with Sen. Aquilino Pimentel III, sponsor of the resolution seeking an inquiry into the Marcos estate tax debts, to discuss which committee will handle the matter, with half of the 24 senators set to end their term by June 30.\nADVERTISEMENT\n\n\n\n\n\n\n“[The investigation can start] anytime, as there are still 12 of them who are not running in the elections,” adding that this can be handled either by the committee on finance, on ways and means, or the Senate blue ribbon committee.\nBIR failure to collect\nSotto said Senate Resolution No. 998, would direct the concerned Senate committee to probe the alleged failure of the Bureau of Internal Revenue (BIR) to collect the taxes due on the estate of the late dictator Ferdinand Marcos since 1997.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nIt also sought to identify the BIR officials, whether past or present, responsible for the noncollection of the estate.\nAccording to Sotto, any concerned committee with related pending bills may also call for the inquiry, not necessarily acting on the Pimentel resolution.\n\n\n\n\nAsked when the Senate can start with the inquiry, Sotto said the committee could convene “in a matter of three or four days from [Monday], if they so desire.”\nSotto, who is running for vice president alongside Sen. Panfilo “Ping” Lacson, said the possible public uproar from the probe might “cut both ways” for the personalities involved, mainly presidential candidate Ferdinand Marcos Jr.\nLacson to inhibit\n“It may be detrimental for some people, because also, it may turn out to be a favor because of the media mileage,” he said.\nIn a Viber message, Pimentel agreed with Sotto, saying the investigation will commence “soonest.”\nLacson, however, said on Monday that he would inhibit himself from the Senate investigation of the estate tax liability of the Marcoses since the issue involves a fellow contender.\nADVERTISEMENT\n\n\n\n\n\n\n“I will have to inhibit because the one involved in the issue is a presidential candidate,” Lacson told reporters.\nLacson nevertheless said the uncollected tax liability was of national interest.\n“Their taxes have to be paid,” Sen. Richard Gordon said as he stressed the need for the “public to know” about the Marcos family’s unsettled estate tax obligations. \n“It’s got nothing to do with timing. The public has the right to know. Their taxes have to be paid, taxes have to be exacted and the government has to enforce the law otherwise, people will stop paying taxes,” Gordon said in an ANC interview on Monday.\nPimentel earlier pushed for a Senate probe of BIR’s supposed failure to collect the estate tax liability of the Marcoses estimated at P203 billion.\nThe BIR earlier confirmed sending a written demand to the Marcos family in December 2021 to pay their estate tax liability after the party of presidential candidate Manila Mayor Franciso Domagoso called for its urgent settlement.\n—WITH A REPORT FROM CHRISTIA MARIE RAMOS\nRELATED STORIES\nDoesn’t matter if Marcos tax case raised only now – Carpio\nLacson won’t participate in Senate probe on Marcos estate tax\nGordon on proposed Marcos estate tax probe: ‘The public has the right to know’\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPH, US troops hold war drills in Tarlac, Cagayan\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: BIR, Ferdinand Marcos Jr., Marcos estate tax debt, Senate probe\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"6":{"Title":"PH, US troops hold war drills in Tarlac, Cagayan","Author":"Frances Mangosing","Publication Date":"April 05, 2022","Content":"AMPHIBIOUS INSERT | A Patriot Minimum Engagement Package is loaded on a landing craft. (Photo courtesy of the 94th Army Air and Missile Defense Command)\nMANILA, Philippines — Almost 9,000 Filipino and American troops have been training together to increase combat readiness and interoperability in various joint drills for this year’s Balikatan, an annual military exercise designed to improve response effectiveness.\nLast week, the two militaries concluded major events — combined arms live-fire exercises (Calfex) in Crow Valley, Tarlac, and amphibious assault operations in Claveria, Cagayan — a practice of combat operations in a scenario of enemy invasion.\nADVERTISEMENT\n\n\n\n\n\n\n“We conducted the Calfex to improve our interoperability during combined and joint operations. This is one way of ensuring that we can operate jointly with our allies,” said Gen. Andres Centino, chief of the Armed Forces of the Philippines.\nHe added, “This also serves as an opportunity for us as we are procuring new equipment; we are able to test our new weapons and armaments.”FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nOther smaller exercises are being held in several military camps in Luzon.\nThe Philippine Air Force (PAF) said that aside from training for offensive counter air and defensive counter air operations, it also conducted exercises on tactical airlift and airdrop, mass casualty evacuation, cybersecurity and radar and radio operations, among others.\n\n\n\n\nCol. Ronie Petinglay, deputy commander of the PAF Air Defense Command, met with Col. Matthew Dalton of the 38th Air Defense Artillery (ADA) Brigade on March 30 to discuss air defense capabilities.\nThe 38th ADA last week deployed for the first time a Patriot air and missile defense system in Aparri, Cagayan, through amphibious insertion.\nThe ADA also conducted a subject matter exchange for defensive counter air operations with the PAF’s Air and Missile Defense personnel to discuss best practices.\nThe armies of the two countries trained for counter-improvised explosive devices and chemical, biological, radiological, and nuclear threats through practical exercises and lectures at Fort Magsaysay in Nueva Ecija, the Philippine Army said.\nFilipino and American troops also conducted free fall and static line airborne to simulate securing an airfield in Cagayan, as part of a combined special operation force event.\nADVERTISEMENT\n\n\n\n\n\n \nThe 12-day exercise will run until April 8.\nRELATED STORY\nA first for Balikatan: US Patriot missiles in PH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nBangsamoro chief to Muslims: Set aside politics during Ramadan\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Balikatan, PH-US military exercises\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"7":{"Title":"Bangsamoro chief to Muslims: Set aside politics during Ramadan","Author":"Jeoffrey Maitem","Publication Date":"April 05, 2022","Content":"FIRST DAY | Filipino Muslims pray inside a mosque in Cotabato City on April 3, as they start observing the first full day of Ramadan. Ramadan will end after a month when Muslims will celebrate Eid al-Fitr, an Arabic term which means “festival of breaking the fast.” (Photo by JEOFFREY MAITEM \/ Inquirer Mindanao)\nCOTABATO CITY, Maguindanao, Philippines — King Umal, 37, walks with his son Jameel, 7, toward the cleaning area to wash his feet before entering the mosque here on Sunday for the first full day of their monthlong Ramadan.\nUmal, who lives not far from the mosque, said he expected this year’s Ramadan to be festive as the government already eased the restriction for COVID-19.“This Ramadan we pray that Allah will strengthen my family and guide us, especially our children,” he told the Inquirer.\nADVERTISEMENT\n\n\n\n\n\n\nOn Friday evening, the moon sighting groups assigned by Mufti Abuhuraira Udasan of the Bangsamoro Darul Ifta, failed to sight the moon crescent, prompting the Bangsamoro Darul Ifta to decide that Ramadan would begin on April 3.\nAcross Mindanao, more than 13 million Filipino Muslims, started the observance of Ramadan with a 14-hour fast.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nDuring Ramadan, Muslims eat two important meals, said Anwar Emblawa, a government employee. The first meal, called “suhoor,” is a predawn meal before “fajr” (morning prayers). Islam believers wake up before 3 a.m. to prepare food, such as rice and bread, and some protein, such as fish. They break the day’s 14-hour fast with iftar, the meal after sunset.\nFive pillars of Islam\nRamadan fasting is one of the five pillars of Islam commemorating the first revelation of the Quran to Prophet Muhammad.\n\n\n\n\nDuring the entire fasting month, Muslims refrain during daylight hours from eating and drinking, smoking and sex, and will aim for general restraint in thought, word and deed. Exempted from the fasts are children, the elderly, the sick, women who are pregnant, nursing or menstruating, and people who are traveling.\nBangsamoro Interim Chief and Moro Islamic Liberation Front chair Ahod “Al Haj Murad” Ebrahim greeted his fellow Muslims and urged them to set aside differences in their political views as they observe the holy month of Ramadan.\nEarlier, Ebrahim expressed his concern over the prospect of the late dictator’s son leading the country, saying the abuses suffered by Moro communities and individuals at the height of martial law under the father and namesake of presidential aspirant Ferdinand Marcos Jr. were still fresh. \n“Let’s strengthen our love for each other. The risk for COVID-19 remains but I believe we can end the problem with pandemic,” he said.\nRELATED STORY\nDuterte: May Muslims have ‘deeper connection with Allah’\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\n6 face charges over mayor’s failed assassination\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nMichelle Madrigal now divorced from husband: ‘Welcome to the new chapter of my life’\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Ahod “Al Haj Murad” Ebrahim, Bangsamoro, ramadan\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"8":{"Title":"6 face charges over mayor’s failed assassination","Author":"Delfin T. Mallari Jr.","Publication Date":"April 05, 2022","Content":"HOME OFFICE | Mayor Filipina Grace America of Infanta, Quezon, on March 30 entertains visitors in her home, which she has turned into a temporary office, while still recuperating from the Feb. 27 gun attack that wounded her four times. (Photo from her Facebook page)\nLUCENA CITY, Quezon, Philippines — At least six suspects, including a candidate for mayor, were charged by the police with attempted murder in connection with the failed assassination of Mayor Filipina Grace America of Infanta town in Quezon province in February.\nWhile Quezon authorities were trying to solve the attack, police in Pangasinan province were also investigating another case involving the ambush that wounded a candidate for councilor in Malasiqui town on Sunday evening.\nADVERTISEMENT\n\n\n\n\n\n\nIn Infanta, America said the filing of the complaints against the six suspects had validated her belief that the assassination attempt was related to politics.\n“It is politically motivated. More than anyone else, I know myself better,” America told the Inquirer in a phone interview on Sunday.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\n1 dead, 7 family members hurt in Ilocos Norte car crash\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nPolice in Calabarzon (Cavite, Laguna, Batangas Rizal and Quezon) said on April 2 that the complaints for frustrated murder and attempted murder were filed on April 1 before the Office of the Provincial Prosecutor district office in Infanta against suspects Eriberto Escueta, LA Ruanto, Gilbert Pacio, Joraffin Plantilla, Bobby Vargaz and Ronil Nolledo.\n‘No involvement’\nEscueta, of Nationalist People’s Coalition, is one of America’s two rivals for the mayoralty post. Ruanto, who is being referred to as reelectionist Infanta Vice Mayor Lord Arnel Ruanto (Liberal Party), is Escueta’s running mate. America is seeking reelection under Nacionalista Party.\n\n\n\n\nEscueta did not respond to text messages and phone calls when the Inquirer tried to reach him for comments on Monday.\nRuanto, on the other hand, said he had yet to receive a copy of the complaint but denied the allegations against him.\n“My life is an open book and I’ve never been involved in any trouble or violent act since I was young,” Ruanto said in a statement posted on social media on Sunday, adding he would fight for the truth.\nThe Infanta police said it had secured sworn statements from three witnesses, which led to the identification of the suspects.\n“The statements corroborated the pieces of evidence earlier gathered by the SITG (Special Investigation Task Group) America, directly pointing to the identity of the suspects in the shooting of the Infanta mayor,” police said.\nADVERTISEMENT\n\n\n\n\n\n\nThe police also presented to the prosecutor’s office the ballistic examination results and security camera footage as added evidence.\nOf the six suspects, Plantilla has a pending warrant of arrest for another criminal case, said Police Col. Joel Villanueva, Quezon police chief, in a phone interview on Monday.\n‘Face the witnesses’\nWhen asked if she believed that Escueta and Ruanto were behind the slay try, America replied, “Yes, I believe.”\n“The fact that I filed and signed the complaints, I fully support the police report because it was the result of their investigation,” America said.\nShe disclosed that one of the witnesses is “very close” to one of the six suspects, whom she did not identify.\nAmerica stressed that before the complaint was lodged, she had not issued any statement against Escueta and Ruanto. She also pointed out that the complaints were based solely on the testimonies of the witnesses and the police investigation.\nShe added she has yet to meet with and talk to the witnesses, noting that if the suspects would refute the complaints against them, “they should face the witnesses.”\n“I’m not in any way a party why they (witnesses) issued their statements,” America said.\nPolice Brig. General Antonio Yarra, Calabarzon police chief, said they would “see to it that these suspects are put in jail and pay for their crime.” \nAmerica was shot four times by an unidentified gunman on Feb. 27 in Barangay Poblacion 1 of her town after attending a church service. She was on board her sport utility vehicle with her assistant, Vergie Borreo, and her cousin and driver, Alvin America, when attacked. The gunman fled on foot, leaving the driver and Borreo unhurt.\n\n\n—WITH A REPORT FROM YOLANDA SOTELO \nRELATED STORY\nInfanta, Quezon mayor hurt in shooting incident\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nNo cases filed yet over Abra checkpoint shootout\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\n‘Significant’ human rights abuses were committed by and for PH gov’t, says US State Dep’t\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\n1 dead, 7 family members hurt in Ilocos Norte car crash\n\n\n\n\n\n\nPacquiao mum on defection of supporters from other camps\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nPutin tells Europe: You cannot ditch Russian gas but we’re turning east\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: failed assassination attempt, Filipina Grace America\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"9":{"Title":"No cases filed yet over Abra checkpoint shootout","Author":"Philippine Daily Inquirer","Publication Date":"April 05, 2022","Content":"HIT | A bullet pierces through the windshield of a police patrol car in Pilar, Abra, after policemen engage security aides of Vice Mayor Jaja Josefina Somera Disono in a shootout on March 29, 2022. (From the PNP CORDILLERA)\nBAGUIO CITY, Benguet, Philippines — No criminal cases have been lodged yet against a town vice mayor in Abra province, a week since the daylight gunbattle between her alleged security team and police officers who were manning an election checkpoint, a police official said on Monday.\nCapt. Ronaldo Eslabra, chief of police of Pilar town, said no charges had been filed as of Monday since the investigation into the shootout and the resulting standoff between the police and the town’s vice mayor, Jaja Josefina Disono, was still underway.\nADVERTISEMENT\n\n\n\n\n\n\nPolicemen in Abra have organized a special investigation task group to look into the exchange of gunfire between policemen and the security escorts of Disono.\nAbra police said they would press charges against Disono if investigators would determine that she harbored armed security employees without the approval of the Commission on Elections and the Philippine National Police.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nDefying protocols\nDisono’s aides reportedly defied protocols and raced through the checkpoint at the town center at 10:30 a.m. on March 29, Eslabra said.\nThe van had sideswiped two police officers as it sped off. A gunfight with the police occurred when a shot struck the windshield of a police vehicle.\n\n\n\n\nInvestigators said the van sought sanctuary at the home of Disono, who refused to surrender the van’s driver after her compound was flanked on all sides by the lawmen.\nDisono’s companions streamed live on social media the security camera footage showing the policemen surrounding her house to sound the alarm that the vice mayor was supposedly “under siege.”\nAfter negotiations, the police retrieved the van for forensic examination and the remains of Sandee Boy Bermudo, who was allegedly killed during the encounter with the police. Bermudo, a resident of Makati City and a former soldier, was part of a 13-man security team hired to protect Disono. \nThe surviving aides of the vice mayor turned themselves in for questioning while 14 high-powered weapons that were licensed to Disono’s family were surrendered for ballistics tests.\n—REPORTS FROM VINCENT CABREZA AND KIMBERLIE QUITASOL\nRELATED STORY\n12 security aides of Abra town vice mayor surrender after standoff with police\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\n‘War crime’ killings near Kyiv spark international outrage\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Abra checkpoint shootout, Jaja Josefina Disono\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"10":{"Title":"A first for Balikatan: US Patriot missiles in PH","Author":"Frances Mangosing","Publication Date":"April 04, 2022","Content":"NO LIVE FIRE | The US Army mounts its first amphibious insertion of a Patriot missile system at the ongoing Balikatan exercises in northern Luzon. The missile system, however, was not tested for live-firing. (Photo from 94th Army Air and Missile Defense Command)\nMANILA, Philippines — The United States has deployed its state-of-the-art air and missile defense system to the Philippines for the first time as part of an annual joint war games and a major display of American force.\nThe US Army in the Pacific carried out the first amphibious insertion of a Patriot missile system — the first time that the United States deployed the system overseas by land and sea — in Aparri in the province of Cagayan, located in the northern Philippines facing south of Taiwan. The deployment was apparently meant to showcase the United States’ capabilities to move around the Indo-Pacific region when needed.\nADVERTISEMENT\n\n\n\n\n\n\n“Air defenders from Bravo Battery, 1st Battalion, 1st Air Defense Artillery Regiment based out of Okinawa, Japan, made history this week as they conducted the first-ever amphibious insert of Patriot Minimum Engagement Package in Aparri, Philippines, as part of #Balikatan22,” the US Army Pacific said on Twitter on March 31.\nFor maritime security expert Collin Koh from the S. Rajaratnam School of International Studies in Singapore, the Americans appeared to be testing out new concepts for future Pacific theater operations, and this fits into the patterns of their recent exercises around the region.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\n“The Patriot deployment would specifically imply the Americans’ concerns about augmenting defenses for its forces in the theater against US adversaries’ growing missile threat,” he told the Inquirer.\nTaiwan situation\nThe joint drills also take place as China continues to step up its military activities near Taiwan, which it believes to be part of its territory. Beijing has been regularly flying its military aircraft into Taiwan’s air defense identification zone, and conducting naval and air drills near the Taiwan Strait, located north of the Philippines.\n\n\n\n\nBut Koh believes the exercises in Cagayan were not aimed specifically at a Taiwan situation, although he said there was a possible indication that the United States would use the Philippines as potential staging ground for its operations in a Taiwan Strait contingency scenario.\nHe recalled President Duterte’s recent statement allowing American forces to use Philippine bases and facilities if Russia’s war on Ukraine spills over to the region. The 1951 Mutual Defense Treaty binds the Philippines and US to come to the aid of the other in case of an armed attack.\n“Under these potential scenarios, the Patriot deployment appears operationally relevant. This is more so considering the Philippines has relatively weak air defenses,” Koh said.\nNot tested for live-firing\nThe weapon system was transported by the US Navy’s Whidbey Island-class amphibious ship USS Ashland through two landing craft air cushions operated by Naval Beach Unit 7 based in Sasebo, Japan.\nUS Marines from Alpha Company, 9th Engineer Support Battalion, prepared the landing site and ensured the Patriot launchers were able to rapidly move to their fighting positions, the US Army said.\nADVERTISEMENT\n\n\n\n\n\n\nThe Patriot—which stands for “Phased Array Tracking Radar to Intercept of Target”—is developed by US weapons manufacturer Raytheon and is currently used by 17 countries. It can track and shoot down attacking missiles and aircraft with a minimum flight time of less than nine seconds and can travel up to 70 kilometers to a target.\nA typical package consists of radars, missiles, launchers, and support vehicles.\nThe deployment of the Patriot missile defense system to the Philippines was part of a mobilization exercise, but it was not tested for live-firing, according to a senior military official involved in the exercise.\nCagayan Gov. Manuel Mamba had earlier opposed live-fire training in joint exercises in his province out of worries that it could offend China, which he saw as a potential major economic investor.\nPrepare and rehearse responses\nThe US Army’s 94th Army Air and Missile Defense Command said the deployment of Patriot to the Philippines was part of larger amphibious and coastal defense operations throughout the joint drills.\n“The Patriot provides critical air defense capabilities and strengthens the ability of the joint and combined force to maintain security across all domains,” it said.\nAlmost 9,000 Filipino and American service members are taking part in the 12-day Balikatan—Filipino word for shoulder-to-shoulder—which ends on April 8.\nThe joint drills are being held as China turns increasingly assertive in the South China Sea, including the West Philippine Sea, and as Russia’s invasion of Ukraine continues.\nThe annual military exercise between the two allies seeks to ensure interoperability of their forces and to prepare and rehearse their responses to various security threats.\n‘High time’\nIn the nearby coastal town of Claveria, also in Cagayan province, Filipino and American troops on Thursday acted out to defend an island from potential invaders through beach landings.\n\n\n“It’s high time, maybe, we never know if we’ll get involved in the unfolding events that we’re hearing about internationally. We don’t know whether we might become involved in them, so at least we’re ready,” Army’s 5th Infantry Division Maj. Gen. Lawrence Mina told reporters on the sidelines of the military drills in Claveria.\nThis year’s Balikatan also saw the participation of a newly formed US Marine Corps unit, 3rd Marine Littoral Regiment—the first of three units “specialized to deal with the rising threat of China,” according to a report of American military newspaper Stars and Stripes. \nThe Marine littoral regiment worked with the Philippine coastal defense regiment to call in simulated strikes from a Marine Corps High Mobility Artillery Rocket Systems, or HIMARS, the report said.\nThe sophisticated long-range missile system was first deployed to Balikatan in 2014.\nThe Balikatan also covers counterterrorism, urban warfare training, maritime security operations, aviation drills, humanitarian projects, and live-fire training in parts of northern and western Luzon.\nRELATED STORIES\n8,900 US and PH troops join forces for Balikatan\nZarate: Balikatan exercises would only heighten tension between US, China\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPresidential bets split over dynasties, turncoatism\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: AFP, Baliktan, PH-US military exercises, US Patriot missiles, USARPAC\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"11":{"Title":"Presidential bets split over dynasties, turncoatism","Author":"DJ Yap","Publication Date":"April 04, 2022","Content":"The podiums for the Commission on Elections “PiliPinas Debates.” (File photo by JOHN ERIC MENDOZA \/ INQUIRER.net0\nMANILA, Philippines — The touchy topic of political dynasties and turncoatism elicited revealing responses and abrasive exchanges among the presidential contenders during Sunday’s debate, as they crossed swords over national and foreign policy issues, each seeking to have a standout moment five weeks before Election Day.\nAs in the earlier face-offs, government corruption remained one of the de facto themes, as the nine candidates — except for Sen. Ferdinand Marcos Jr. who was again absent in the debate hosted by the Commission on Elections (Comelec) — were asked whether they believed it was a problem of people or systems.\nADVERTISEMENT\n\n\n\n\n\n\nThe first confrontation of the night occurred when labor leader Leody de Guzman, who had answered the question by saying it was a problem of the electoral and political system, challenged Sen. Panfilo Lacson, who differed with him and said the problem lay with the officials running the system.\n“The biggest problem is the trapos (traditional politicians) and the political dynasties are the ones who keep getting elected in government,” De Guzman said, rebutting Lacson’s earlier contention that the lack of leadership was the root of the problem.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\n“That’s why I said it’s people who are the problem. For me, the test of character to any official is to offer them power or money. If they pass the test, their character is good,” the senator said.\n“It’s the leader who needs to set the example so that they could fully implement their policies,” Lacson said.\n\n\n\n\nBut De Guzman argued: “What I’m talking about is the system of election, not of people. What I’m saying is even if the law allows the Comelec to ban trapos and dynasties, they are able to come in anyway.”\n‘Take it easy’\nThe exchange was cut short when the moderator, broadcast journalist Ces Drilon, asked De Guzman “to take it easy” as the next topic would focus on political dynasties.\nBy the next round of questioning, it was Sen. Manny Pacquiao’s turn on the hot seat after he defended the existence of political dynasties, without mentioning that besides himself, multiple members of his clan were running in the May elections.\n“I’m okay with [banning] political dynasties… but remember we are a democracy. People vote for those who get to sit in office. They are not appointed,” the retired boxer argued.\n“It would be unfair to families who are giving honest service and making changes… Not everybody steals from the government,” Pacquiao added.\nADVERTISEMENT\n\n\n\n\n\n\nHis statement immediately drew stinging rebuttals from his opponents.\n“We would like to remind Senator Pacquiao, with all due respect, that political dynasties are not allowed as provided by law. Whatever the reason, the law says that the state prohibits political dynasties,” lawyer and doctor Jose Montemayor Jr. said.\n“We should be doing something about thick and fat dynasties, instead of defending them,” he added.\nBusinessman Faisal Mangondato chimed in, saying the senator was wrong to claim that political dynasties were okay as long as people kept voting for them.\n“That cannot be,  because [political dynasties] are the [reason] why politics is being dominated by rich families,” he said.\nBut Pacquiao insisted that banning members of a political clan from running for office would infringe upon their freedoms.\n“The Constitution says each one has the right to run in an election. So if you stop them from running, you are preventing them from exercising their right,” he said.\nPolitical butterflies\nThe next question on the party system and turncoatism also showed a glimpse into the candidates’ political savvy.\nVice President Leni Robredo said she believed that politicians jumping from one party to the next every election “weakens the party system because those running don’t look at what the parties are fighting for and only join them for convenience.”\n“As long as we allow turncoatism, we cannot expect to strengthen our political parties. We need a law to strengthen our political parties and force politicians to join parties because of the principles of the party,” she said.\n\n\nRobredo said it might also be high time to revisit whether the current multiparty system was still working for the Filipino people and entertain the possibility of a return to the two-party system.\nDe Guzman agreed that there should be a law against “political butterflies” with a caveat: “My reservation is that [most parties] have the same agenda and protect the same interests: for capitalists, big business and elitists.”\nFormer defense chief and national security adviser Norberto Gonzales lamented how easy it was for Filipino politicians to switch parties “because they don’t understand what parties mean.”\n“But if we look at mature democracies, political parties are extremely important, because they represent not only the coming together of politicians but the formation of collective sentiment — what kind of society do they want to create?” he said.\nManila Mayor Francisco “Isko Moreno” Domagoso, who has been criticized for changing parties several times throughout his 24-year career in politics, said it was time for major political reforms in the Philippines.\nHe launched into a summation of his campaign proposals, including the return of the two-party system, the election of the president and the vice president under the same ticket, a regional composition of the Senate, and an overhaul of the party-list system.\n“Are they (party-list systems) really representing the marginalized? Are they really representing the intent of the law? I think we need to pass another law, through Congress or a people’s initiative, for a change in our political system. It’s high time,” Domagoso said.\nHuman rights\nThe candidates were also asked about their stance on issues affecting the Association of Southeast Asian Nations (Asean), the plight of overseas Filipino workers, and regional cooperation.\nIn particular, they were quizzed about their take on human rights violations in other countries, particularly the ongoing military coup in Myanmar.\nThe government must first improve its own human rights situation and global standing before it can even ask other nations, like Myanmar, to observe international treaties on human rights, De Guzman and Pacquiao said, even as other candidates asserted that the Philippines must take the lead in demanding that these nations observe international obligations.\n\n\nBoth De Guzman and Pacquiao agreed that the Philippine government must first prove that it respects the rights of Filipinos or it would not have the credibility to speak on such matters.\n“The government will not have the moral credibility to speak on such matters if it itself is the prime violator of human rights,” De Guzman said, alluding to the numerous violations flagged under President Duterte’s twin war on drugs and insurgency. “Our country must first have a government that will protect human rights before it can have a standing before Asean nations.” \nFor Pacquiao, it was hard to make a suggestion “to other countries on issues like this when our own country [does] not have a good image or reputation [before the world].”\nLacson and Domagoso, meanwhile, pushed for a more proactive approach to the problem and argued that the Philippines must lead the charge in asking other nations to observe international treatises.\n“Let’s ask them because we shouldn’t be the only ones asked by other nations all the time to observe our obligations,” Domagoso said, alluding to how several governments and international groups had repeatedly called on the Duterte administration to show respect for human rights locally.\nRELATED STORIES\nDesire to hold on to power creates political dynasties — Drilon\nSolon backs proposed ‘anti-turncoatism’ charter amendment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nUnicef: Many children drop out as in-person classes reopen\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 presidential race, Comelec presidential debate, Political Dynasties, Turncoatism\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"12":{"Title":"Unicef: Many children drop out as in-person classes reopen","Author":"Jane Bautista","Publication Date":"April 04, 2022","Content":"INQUIRER.net stock photo\nMANILA, Philippines — As the COVID-19 pandemic continued to worsen the learning loss of children globally, emerging data from the United Nations Children’s Fund (Unicef) found that many children have dropped out as classrooms reopened for in-person classes.\nIn the Philippines, the number of out-of-school youth rose at the onset of the pandemic from 16.9 percent in January 2020 to 25.2 percent three months later in April 2020, based on a study released by the US Agency for International Development in November 2021.\nADVERTISEMENT\n\n\n\n\n\n\nWhile various distance learning approaches were implemented and the remote classes were considered a “victory” by the Department of Education (DepEd), there were at least 1.1 million students who did not enroll for school year 2020 to 2021 due to lack of internet access, among other reasons.\nThe official enrollment at the basic education level reached 27.2 million on Nov. 15, 2021, according to the DepEd’s Learner Information System.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nUP Law’s first magna cum laude in over a decade stays grounded\n\nThis was 3.83 percent higher than the 26.2 million enrollment in the previous school year when the restrictive lockdowns were imposed due to the pandemic.\nThe DepEd said it would release this week the updated number of children who dropped out of school and, in a statement last week, noted that it was working on a “learning recovery plan” intended to address the gaps and challenges brought by the pandemic.\n\n\n\n\nIn neighboring countries, various measures have been in place such as an early warning system developed in Malaysia to monitor the children at risk of dropping out. Their Ministry of Education also tracks out-of-school youth with the help of local authorities and community leaders.\nIn Thailand, a nationwide effort aimed at identifying children not returning or at risk of not returning to school was also underway, Unicef said.\nMost vulnerable\nIn other countries such as South Africa, Unicef said the number of out-of-school children tripled from 250,000 to 750,000 between March 2020 and July 2021, while around one in every 10 schoolchildren in Uganda did not return to school in January after a two-year closure.\nThe dropout rate among secondary female students in Malawi, a landlocked country in southeastern Africa, increased from 6.4 percent to 9.5 percent between 2020 and 2021 while in Kenya, 16 percent of girls and 8 percent of the boys among 4,000 survey respondents said they did not return to schools when they reopened.\n“Out-of-school children are some of the most vulnerable and marginalized children in society. They are the least likely to be able to read, write or do basic math, and are cut off from the safety net that schools provide,” Unicef said in a statement last week.\nADVERTISEMENT\n\n\n\n\n\n\nThis puts the out-of-school youth at increased risk of exploitation and a lifetime of poverty and deprivation, the humanitarian organization added.\nUnicef also noted that with the current “slow learning pace,” most schoolchildren would take seven years to learn basic reading skills and 11 years for foundational numeracy skills, which should have been grasped in two years.\nAs the public health crisis enters its third year, Unicef said that 23 countries catering to around 405 million learners were yet to fully reopen their schools, “with many schoolchildren at risk of dropping out.”\n“This rising inequality in access to learning means that education risks becoming the greatest divider, not the greatest equalizer. When the world fails to educate its children, we all suffer,” said Catherine Russell, Unicef executive director.\nReading problem\nLearning poverty, described by the World Bank as the share of 10-year-olds who cannot read or understand a simple story, has been worsened by two years of school closures due to COVID-19, according to Unicef.\nIn the Philippines, the latest Unicef assessment showed that less than 15 percent of schoolchildren, or about three in every 20, can read simple texts, in large part due to the closure of schools for more than 70 weeks, the longest among 122 countries covered by the Unicef report.\nThis translated to a learning poverty of 85 percent. In 2019, or before the pandemic happened, the rate was 69.5 percent, according to the World Bank.\nUnicef’s latest joint report with the UN Educational, Scientific and Cultural Organization (Unesco) and the World Bank titled “Where are We on Education Recovery?” showed that schools in the Philippines had been closed from face-to-face classes the longest among the 122 countries covered. \nSince the onset of the pandemic in mid-March 2020, only a few schools in the country have returned to in-person instruction and the government had piloted face-to-face schooling in public schools, but in a limited scope as COVID-19 continued to rear its ugly head.\n“Schoolchildren around the world have missed an estimated two trillion hours — and counting — of in-person learning since the onset of the pandemic and subsequent lockdowns,” Unicef added.\n\n\nUnicef noted that even before the pandemic more than half of 10-year-olds in low- and middle-income countries were unable to read or comprehend a simple story — “now that figure is estimated to be as high as 70 percent.”\nRELATED STORIES\nDepEd: Over 10,000 schools OK’d to resume limited in-person classes\nDepEd eases rules for schools to resume in-person classes\nPediatric vaccination ‘vital’ to reintroduction of in-person classes – DepEd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nJoel Reyes back to reclaim top Palawan seat\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\n‘Falsified’ info on drug war deaths spurs probes\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nGun ban dispute splits top Comelec officials\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nAgaton: Mud keeps yielding bodies\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nMom of food pantry advocate sues Lorraine Badoy\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected health standards\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: COVID-19 pandemic, in-person classes, UNICEF\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"13":{"Title":"Joel Reyes back to reclaim top Palawan seat","Author":"Romar Miranda","Publication Date":"April 04, 2022","Content":"POLITICAL COMEBACK | Joel Reyes (fourth from right) enjoys a light moment with his supporters at his residence in Barangay Sta. Monica, Puerto Princesa City, as he launches his campaign for governor in Palawan province. (Photo by CEDEZ CASTRO \/ CONTRIBUTOR)\nPUERTO PRINCESA CITY, Palawan, Philippines —Former Palawan Gov. Joel Reyes, the principal suspect in the 2011 murder of environmentalist and hard-hitting broadcaster Gerry Ortega, emerged in public for the first time in years on Sunday to campaign for his bid to return to the seat of power in the provincial government.\nReyes resurfaced after obtaining a temporary restraining order (TRO) on March 23 from the Supreme Court against the warrant of arrest issued by a Palawan court in July 2021 in connection with the slaying of Ortega, who was gunned down in a thrift shop near his veterinary clinic in this city on Jan. 24, 2011.\nADVERTISEMENT\n\n\n\n\n\n\n“It was like mission impossible. I never thought or imagine[d] I would ever be able to come back here,” Reyes, the principal accused in the Ortega murder case, said in a speech before his supporters who welcomed him in his residence in the village of Sta. Monica.\nSunday’s appearance of Reyes, who filed his candidacy by proxy last year, marked the start of his campaign for the gubernatorial race in May.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nReyes, running as an independent, is vying for the seat against incumbent Vice Gov. Dennis Socrates and four other candidates—Art Ventura, Erick Abueg, Richard Lopez and Agapito Salido Jr.\nOutgoing Gov. Jose Alvarez, who is serving his last term, is running for congressman in the second district of the province.\n\n\n\n\nReyes is accused of masterminding the 11-year-old Ortega murder slay, along with his brother, incumbent Coron Mayor Mario Reyes, who is seeking reelection for his third term.\nReyes explained that the Supreme Court decision to issue a TRO was in response to his camp’s motion for reconsideration seeking the “lifting of the warrant of arrest and reinstating the [petition for the] dismissal of the case filed at the Court of Appeals (CA).”\nPetition for review\nHe flew to Puerto Princesa from Metro Manila on Sunday and immediately visited a local church to attend a service as his first appearance in public after his release from detention early last year to serve his sentence for a graft case.\nReyes’ legal counsel, lawyer Joaquin Hizon, said they filed a petition for review of the high court’s ruling rejecting the CA’s previous decision to acquit his client of Ortega’s murder.\n“’Yon yong nakasampa ngayon sa Supreme Court. Habang yon ay pinag-aaralan ng Supreme Court, meron tayong TRO sa korte at sa implementing agencies ng gobyerno (That’s what we have filed in the Supreme Court. While the Supreme Court is reviewing our case, we have a TRO on the court and other implementing agencies of the government),” Hizon said.\nADVERTISEMENT\n\n\n\n\n\n\nIn December 2019, the CA set aside its January 2018 ruling that upheld Reyes’ petition questioning the merit of his trial. The CA then reinstated the murder case against Reyes and directed the Palawan regional trial court (RTC) to issue a warrant of arrest against the former governor.\nHowever, by then Reyes was already in detention for a graft conviction in a mining case in 2017. He was moved to a jail at Camp Bagong Diwa in Taguig City in Metro Manila where he remained until his release in April 2021.\nOrtega was shot multiple times in the head and body by a lone assailant in Puerto Princesa City.\nThe alleged gunman, Marlon Recamata, was caught with the help of bystanders. His alleged accomplices, Dennis Aranas and Armando Noel Loria, were arrested in the following days.\nRecamata later confessed to the killing and said his group was hired for the hit job in exchange for P150,000 by Rodolfo Edrad Jr., a former Reyes bodyguard.\nArrested in Thailand\nIn February 2011, Ortega’s widow, Patria Gloria, filed a murder complaint against Reyes, his brother Mario and 10 others at the Department of Justice (DOJ), saying only Reyes had the motive to order her husband killed.\nIn his daily radio program, Ortega had criticized Reyes for the former governor’s inability to stop the abuses and violations of environmental laws committed by mining companies in Palawan.\nIn March 2012, Reyes and his brother, fled to Vietnam to evade arrest after the DOJ indicted them for Ortega’s murder.\nAfter a three-year manhunt, the Reyes brothers were arrested in Phuket, Thailand, in September 2015 and deported to Manila for violating Thai immigration laws. They were eventually detained at the Puerto Princesa City jail.\nIn January 2016, the Supreme Court directed the Palawan RTC to proceed with the trial of Reyes for the murder of Ortega.\n\n\nThe RTC denied Reyes’ petition for bail in September 2016.\nIn January 2018, Reyes was released from the Puerto Princesa City jail after the CA upheld his petition questioning the merit of his trial as suspect in the case.\nBut in November 2019, a CA decision penned by Associate Justice Marie Christine Azcarraga-Jacob set aside its January 2018 ruling, reinstating the case and directing the Palawan RTC to issue a warrant of arrest against Reyes. \nOn July 14, 2021, Judge Angelo Arizala of Branch 52 of the Palawan RTC issued the arrest warrant, nearly two years after the CA reversed its own 2018 decision to dismiss the murder case against Reyes for lack of probable cause.\n—With REPORTS FROM INQUIRER RESEARCH \nRELATED STORY\n9 years after doctor-radioman Gerry Ortega’s murder, NUJP still pushing for justice\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nVenezuelan chef makes waves in HK with tacos\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 elections, Gerry Ortega, Joel Reyes, Palawan gubernatorial race\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"14":{"Title":"Comelec official proposes task force vs disinformation","Author":"Dona Z. Pazzibugan","Publication Date":"April 04, 2022","Content":"Comelec Commissioner George Garcia speaks to the member of the press. John Eric Mendoza\/INQUIRER.net\nMANILA, Philippines — Election Commissioner George Garcia wants the Commission on Elections (Comelec) to go after those who question the integrity of the coming May 9 general elections.\n“I will personally convince the commission en banc next week to create a task force against fake news,” he said in a media forum on Sunday.\nADVERTISEMENT\n\n\n\n\n\n\nHe griped against claims circulating on social media that the election results have already been decided because the ballots to be used in the automated elections have been tampered with.\n“Against anything that would undermine the integrity of the [electoral] process, we have to fight back,” said Garcia, a practicing election lawyer before he was appointed poll commissioner last month.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nHe urged the public to rely only on “trustworthy” news sources and “avoid fake news.”\nLast week, the Comelec created a task force to investigate alleged vote buying incidents. Commissioner Aimee Ferolino was put in charge of Task Force Kontra Bigay.\n\n\n\n\nThe Comelec included in the task force representatives from the Department of Justice, Presidential Anti-Corruption Commission, the Department of the Interior and Local Government, Philippine Information Agency, National Bureau of Investigation, Philippine National Police and the Armed Forces of the Philippines.\nMeanwhile, the Comelec has deployed at least 80 percent of the election supplies to be used for overseas voting that will start on April 10.\nGarcia said all the election supplies would have reached the country’s embassies and consulates before voting starts next week.\nHe said two commissioners were currently abroad to oversee the “training” of embassy personnel who would man the overseas voting.\nIn its website, the Comelec reported that 1,697,215 registered overseas voters will vote for national candidates from April 10 to May 9.\nADVERTISEMENT\n\n\n\n\n\n\nIt said 46 Philippine foreign posts will use an automated election system, while another 46 posts will use the manual system of voting.\nGarcia said they would consider overseas voting a huge success if the voter turnout exceeds 1 million. \nOverseas voting posted a 31-percent turnout in the 2016 presidential elections and an 18-percent turnout in the 2019 midterm elections.\nRELATED STORY\nGroups ask SC to compel Comelec to make May 2022 polls preps transparent\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nSotto assured of NPC support, leadership\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 elections, Comelec disinformation task force\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"15":{"Title":"Sotto assured of NPC support, leadership","Author":"DJ Yap","Publication Date":"April 04, 2022","Content":"Senate President Vicente Sotto III –(Photo from Sen. Panfilo Lacson’s office)\nMANILA, Philippines — Senate President Vicente Sotto III, chair of the Nationalist People’s Coalition (NPC), on Sunday denied that his party had abandoned him and jumped ship to the “UniTeam” ticket of former Sen. Ferdinand Marcos Jr.\n“We are the leadership,” Sotto told journalists in a Viber message, stressing that the party’s founder, deceased tycoon Eduardo “Danding” Cojuangco Jr. entrusted the party to him and Cojuangco’s trusted ally Ramon Ang, now president of San Miguel Corp., could attest to that fact.\nADVERTISEMENT\n\n\n\n\n\n\nThe Senate leader also shared with the Inquirer a message from NPC secretary general Mark Llandro Mendoza sent to its members: “We would like to clarify that the leadership and the party is fully supporting our [chair], SP Tito Sotto, for vice president.”\nNo prexy bet\nThe NPC, one of the country’s largest political parties, has not endorsed any presidential candidate, including Sotto’s running mate, Sen. Panfilo Lacson, who used to carry the Partido Reporma banner but is now an independent after the party switched allegiance to Vice President Leni Robredo.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nSotto made the remarks in a series of Twitter posts on Sunday morning amid speculations that NPC was officially supporting Marcos and his running mate Mayor Sara Duterte, after party members in Tarlac, led by Gov. Susan Yap, declared support for Marcos and Duterte in a UniTeam campaign sortie on Saturday.\n‘Personal decisions’\nBut the governor, including her brother and fellow party member Rep. Victor Yap, clearly said the endorsement was their “personal decisions” and not that of NPC.\n\n\n\n\nLacson chimed in, saying Yap “couldn’t have said it more clearly: she alone supports another tandem and does not impose on her party mates and constituents.”\n“As we often tell each other, there are dynamics in this campaign that we cannot comprehend, much less control,” he said.\nOn Saturday, Marcos and Duterte talked with local and sectoral leaders in a meeting organized by the Yap siblings. The meeting was not open for media coverage.\nIn a press statement, the Lakas-Christian Muslim Democrats (Lakas-CMD) of Duterte said leaders of NPC in Tarlac had endorsed her and Marcos. \nThe Lakas statement said the Yap siblings had given party members and their allies in the province the freedom to choose whom to support for president and vice president.\nADVERTISEMENT\n\n\n\n\n\n\nAccording to Lakas-CMD, Rep. Yap said the NPC-Tarlac chapter and its political allies had decided to back the UniTeam candidates.\n“Yes, we the provincial NPC and those others [affiliated or not] support the [Marcos and Duterte] tandem,” Yap said as quoted by the Lakas-CMD.\nRELATED STORIES\nLacson won’t prevent Sotto from joining Pacquiao rallies\nPacquiao: Team up with Sotto possible if Atienza quits VP race\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nWreaths offered at ‘disrespected’ Ninoy statue\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 vice presidential race, Nationalist People’s Coalition, Vicente Sotto III\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"16":{"Title":"Wreaths offered at ‘disrespected’ Ninoy statue","Author":"Krixia Subingsubing","Publication Date":"April 04, 2022","Content":"RESPECT Tarlaqueños lay wreaths at the monument of the late Sen. Benigno Aquino Jr. in Tarlac City. —PHOTO COURTESY OF ROBREDO PEOPLE’S COUNCIL\nTARLAC CITY, Tarlac, Philippines — Wreaths of flowers were offered to the statue of the late Sen. Benigno “Ninoy” Aquino on Sunday, a day after his image was “disrespected” when it was covered by a tent and a tarpaulin during the grand rally on Saturday of the tandem of presidential aspirant Ferdinand Marcos Jr. and running mate Davao City Mayor Sara Duterte at Tarlac City plaza and sparked an online backlash.\nPeople clad in pink, mostly members of Robredo People’s Council (RPC) in Tarlac backing presidential aspirant Vice President Leni Robredo, laid flowers on Aquino’s monument and that of the adjoining statue of his wife, the late former President Corazon Aquino, after the disrespectful incident.\nADVERTISEMENT\n\n\n\n\n\n\nPink and yellow ribbons were tied in the flowers with lace bearing “Ninoy, hindi ka nag-iisa (you are not alone).”\nTarlac was the home province of the late senator and chief rival of the elder Marcos, who once declared that the Filipino “is worth dying for.”FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nThe statue of Senator Aquino, whose assassination in August 1983 became one of the catalysts that led to the People Power Revolution in Edsa in 1986 that toppled the strongman rule of Ferdinand Marcos, was covered by a tent during the Marcos Jr.-Duterte UniTeam political grand rally.\n“They could have just held it in another venue or at least, put the tent beside the monument, but not in front,” said Tarlac historian Xiao Chua.\n\n\n\n\n“It might have been unintentional, or just plain lack of common sense on the part of the organizers, but it was an unfortunate slap to the province’s historic legacy and furthers the politically divisive climate with deep implications,” Chua added.\nSeveral Tarlaqueños and martial law survivors cried foul at what they called “disrespect,” not only to the Aquinos but also to those who suffered under the martial law regime.\nTarlac City Mayor Ma. Cristina “Cristy” Angeles, who was present during the rally, has told her critics to “move on.”\n“Ignore those who criticize. It’s time for forgiveness and healing, we will unite,” Angeles said told reporters on Saturday. \nBut she was mum on who ordered the Ninoy monument to be covered, even as Tarlac residents expressed their disappointment with her decision to back the UniTeam.\nADVERTISEMENT\n\n\n\n\n\n\nAngeles’ mother, Teodora Cuello, is a known supporter of the late President Corazon Aquino and serves as one of the officers of Cory’s Piso’t Puso foundation in Tarlac. The mayor’s husband, contractor Victor Angeles of Northern Builders, has bagged projects during the administration of the late President Benigno Aquino III.\n“She has to apologize to her own constituents. She disrespected a son of Tarlac [Ninoy Aquino]. The person she disrespected was a governor, mayor, and congressman [from Tarlac City],” lawyer Jo Clemente of RPC said.\nRELATED STORIES\nAquino statue blocked as Marcos Jr. campaigns in Tarlac\nBishop censures blocking of Ninoy Aquino statue in Tarlac\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nQuiboloy lawyers dismiss impact of co-accused’s plea bargain\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\n1 dead, 7 family members hurt in Ilocos Norte car crash\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nMichelle Madrigal now divorced from husband: ‘Welcome to the new chapter of my life’\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 presidential race, blocked Ninoy Aquino statue, Ferdinand Marcos Jr., Marcos Tarlac City rally, Sara Duterte-Carpio\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"17":{"Title":"Robredo urges ‘digital natives’ to fight fake news","Author":"Krixia Subingsubing","Publication Date":"April 04, 2022","Content":"Vice President Leni Robredo (File photo from VP Leni Media Bureau)\nYoung people who have access to information should help parry the lies unleashed by those who want to win the 2022 elections through disinformation, Vice President Leni Robredo said, as she exhorted the “digital natives” to lead the charge against fake news.\nIn a political rally in Naval, Biliran, Robredo noted how malicious actors have been “twisting her words to deceive people and make it appear that she doesn’t have a clear program for Filipinos.”\nADVERTISEMENT\n\n\n\n\n\n\nRobredo was alluding to viral posts where her statement about upskilling maritime workers was twisted to make it appear as if she believed the industry isn’t skilled enough.\nIn reality, seafarer programs are among her flagship programs outlined in her Angat Buhay agenda declared as early as October.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\n“The maritime industry is one of the first things I’ve vowed to prioritize, including our seamen, but because of fake news, they chopped up my statement to convey the opposite of what I said,” she said.\nWhile Robredo herself has started aggressively pushing back on fake news — even posting false claims on her own Facebook profile to debunk them—she called on the youth not only to vote for her, but to put their knowledge to good use and combat disinformation on social media.\n\n\n\n\nShe also thanked those who have slowly started to push back against efforts to malign her through disinformation. \nOn Saturday, the student governments of six of eight schools under the University Athletic Association of the Philippines (UAAP) said they were endorsing Robredo and her running mate, Sen. Francis Pangilinan, for the country’s top two posts.\nThe six schools—Adamson University, Ateneo de Manila University, Far Eastern University, National University, the University of Santo Tomas and the University of the Philippines—based their endorsements on the results of their internal mock polls where Robredo and Pangilinan came out far ahead.\nAs for the remaining two schools: De La Salle University has yet to finish its mock poll; and the University of the East has only endorsed Robredo as it was not yet done with its vice presidential poll.\nRELATED STORIES\nADVERTISEMENT\n\n\n\n\n\n\nComelec official proposes task force vs disinformation\nRobredo is biggest disinformation victim; Marcos gains from ‘misleading’ posts — fact-checker\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nIndex crimes like theft, robbery up slightly\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: #VotePH2022, 2022 presidential race, fake news, Leni Robredo, netizens\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"18":{"Title":"Index crimes like theft, robbery up slightly","Author":"Philippine Daily Inquirer","Publication Date":"April 04, 2022","Content":"Interior Secretary Eduardo Año. INQUIRER FILE PHOTO \/ NINO JESUS ORBETA\nMANILA, Philippines — The rate of index crimes, particularly theft, has gone up slightly since Alert Level 1 — the most lenient COVID-19 alert level — was implemented nationwide, Interior Secretary Eduardo Año said on Sunday.\nThere has been an observed uptick in pickpockets and snatchers since the lifting of COVID restrictions for the first time in two years since the start of the pandemic, he said in a radio interview, without citing statistics.\nADVERTISEMENT\n\n\n\n\n\n\n“Maybe because people are going out more to the malls, markets, there has been an increase in pickpockets,” he said. \n“The public should exercise caution when going out to shop and heading to business establishments. But our [police officers] are ready. Don’t hesitate to report to them because they will act on it immediately,” he said.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n‘Isko’s withdrawal will hurt Leni’\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nRELATED STORY\nPH safer as crime rate drops amid war on drugs — PNP chief\nATM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nLow pressure area east of Visayas spotted\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: DILG, Eduardo Año, index crimes\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"19":{"Title":"Low pressure area east of Visayas spotted","Author":"Philippine Daily Inquirer","Publication Date":"April 04, 2022","Content":"MANILA, Philippines — A low pressure area (LPA) east of Visayas is expected to enter the Philippine area of responsibility on Monday.\nADVERTISEMENT\n\n\n\n\n\n\nThe low pressure area was spotted 1,210 kilometers east of Visayas, the Philippine Atmospheric, Geophysical and Astronomical Services Administration said on Sunday afternoon.\nBut the weather disturbance is unlikely to strengthen into a tropical cyclone but is expected to cross Mindanao, Visayas and Palawan in the next few days.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nMom of food pantry advocate sues Lorraine Badoy\n\nNEWSINFO\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\nTwo weather systems are currently affecting the country, Pagasa said.\nA shear line will bring cloudy skies with scattered rain and thunderstorms in Cagayan Valley, Apayao, and Ilocos Norte on Monday.\n\n\n\n \nModerate to heavy rain are expected in parts of Visayas, Mindanao, Masbate, and Sorsogon due to an intertropical convergence zone. Metro Manila and the rest of Luzon will have fair weather with chances of isolated rain and thunderstorms.\n—FRANCES MANGOSING\nRELATED STORY\nPagasa: LPA off E. Samar enters PAR; isolated rain showers expected\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPolice: 2 Boracay tourists died by ‘homicide and suicide’\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\n‘Agaton’ death toll climbs to 76; 29 persons still missing\n\n\n\n\n\n\nBongbong Marcos to Comelec: Ensure that votes are counted correctly\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nDOH warns of possible COVID-19 surge by May due to neglected heath standards\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\n1 dead, 7 family members hurt in Ilocos Norte car crash\n\n\n\n\n\n\nLIST: Holy Week mall operating hours\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nMichelle Madrigal now divorced from husband: ‘Welcome to the new chapter of my life’\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Low pressure area, Pagasa, Philippine weather\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"20":{"Title":"Police: 2 Boracay tourists died by ‘homicide and suicide’","Author":"Philippine Daily Inquirer","Publication Date":"April 04, 2022","Content":"A beach on Boracay Island. This photo was taken on March 28, 2022. (File photo by JACK JARILLA)\nILOILO CITY, Iloilo, Philippines — The death of two tourists, including an Australian national, in their hotel room on Boracay Island last week was likely due to a case of “homicide and suicide,” according to a police investigation.\nLt. Col. Don Dicksie de Dios, the police chief in Malay town in Aklan province where the island resort is located, said they had ruled out that a third person was involved in the deaths of Dennis Yu and Maria Cecilia Jellicode on March 21.\nADVERTISEMENT\n\n\n\n\n\n\nMedicolegal examination results showed that Jellicode bore “ligature marks” that could indicate strangulation while Yu had cuts believed to be self-inflicted.\nA hotel staff member found the remains of the couple, both 44 years old, lying near each other on the floor of their room. The staff checked on them due to their scheduled checkout time.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nYu, a businessman from Quezon City, and the Philippine-born Jellicode, from Brisbane in Australia, arrived on the island on March 13 and were supposed to check out from their hotel in Barangay Balabag on March 21.\nDe Dios said the couple’s belongings, including cash in foreign and peso denominations, were intact and were returned to their next of kin.\n\n\n\n\nAutopsy and toxicology test results also showed that Jellicode died earlier than Yu. He was also seen leaving their room alone around 9 a.m. before returning shortly.\nThe couple’s mobile phones were still subjected to a digital forensic test to shed more light on the incident.\nThe couple was last seen alive having breakfast at the hotel a few hours before the recovery of their remains. \nThe Philippine National Police in Boracay has assured the safety of tourists on the world-famous destination as more tourists are expected to visit the island after more than two years of travel and quarantine restrictions due to the COVID-19 pandemic.\n—NESTOR P. BURGOS JR.\nRELATED STORY\n2 Boracay tourists found dead in hotel room\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nElectricity rates in Metro Cebu expected to increase in April\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nDepEd’s Manila office sorry about module mocking Leni\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Boracay suicide-homicide, dead Boracay tourists, Dennis Yu, Maria Cecilia Jellicode\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"21":{"Title":"Electricity rates in Metro Cebu expected to increase in April","Author":"Ador Vincent Mayol","Publication Date":"April 04, 2022","Content":"RESTORED Metro Cebu consumers, who started getting stable power supply only recently following the onslaught of Typhoon Odette in December 2021, now face higher electricity bills amid soaring coal prices due to the war between Russia and Ukraine. (Photo by GRACE OBERES)\nCEBU CITY, Cebu, Philippines — Electricity rates in Metro Cebu are expected to rise this month due to high fuel prices that resulted from the ongoing war between Russia and Ukraine.\nEngineer Raul Lucero, president and chief operating officer of Visayan Electric, said they were projecting an increase in generation costs as demand for coal in Asia increased.\nADVERTISEMENT\n\n\n\n\n\n\n“As to how much, we still don’t know. We’re waiting for the billing statement from our suppliers,” he said.\nLucero said coal suppliers from Europe, who were heavily affected by the Russian invasion of Ukraine, were starting to source coal from Asia, particularly in Indonesia, a key supplier for coal-fired plants in the country. The Philippines imports around 75 percent of its coal requirement from Indonesia and Australia.FEATURED STORIES\nNEWSINFO\nBongbong Marcos sympathizer Querubin withdraws support from church group \n\nNEWSINFO\n7k attend Marcos rally in Catarman\n\nNEWSINFO\nFilipino woman found dead in a suitcase\n\nAccording to Lucero, Visayan Electric has been trying to find ways to best cushion the impact of the rise of the electricity rates on its consumers.\n“Hopefully, we can manage the increase. One of the solutions we’re considering is to take advantage of the lower prices of WESM (Wholesale Electricity Spot Market) during off-peak [hours],” he said.\n\n\n\n\nWESM, created under Republic Act No. 9136, or the Electric Power Industry Reform Act of 2001, is a centralized venue for buyers and sellers to trade electricity as a commodity where prices are determined based on actual demand and supply.\nVisayan Electric sources its energy requirement from coal-powered plants in the Visayas grid.\nOf the at least 19 coal-fired plants in the country, five are located in the Visayas. These are Toledo Power Corp. in Toledo City in southwestern Cebu province; Kepco-SPC Power Plant in the City of Naga, south Cebu; Cebu Energy Development Corp., also located in Toledo City; Aboitiz Power-owned Therma Visayas Inc. in Toledo City; and Panay Energy Development Corp. Coal Power Plant in La Paz, Iloilo City.\n99-percent restored\nThe projected rate increase came at a time when Metro Cebu, Visayan Electric’s franchise area, was just starting to recover from the devastation wrought by Typhoon “Odette” (international name: Rai), which hit many parts of the Visayas and Mindanao in December last year.\nThe utility company has also just restored electricity in its franchise area, with many of their consumers having to wait for months before they could get their power back.\nADVERTISEMENT\n\n\n\n\n\n\nLucero said that restoration of power in their franchise area was 99 percent as of Sunday.\nOnly at least a thousand customers in remote mountain villages have no electricity as Visayan Electric has a hard time bringing their equipment and poles to these areas. \nAmong those that now have electricity were the schools in Metro Cebu that were being eyed as polling centers for the May 9 elections.\nLucero said Visayan Electric had guaranteed that power would be available in polling centers three days before and after the May 9 elections.\nVisayan Electric is the second largest power distributor in the Philippines with over 400,000 subscribers. It covers the cities of Cebu, Mandaue, Talisay, and Naga, and the municipalities of Minglanilla, Liloan, Consolacion, and San Fernando.\nRELATED STORIES\nRollback in local fuel prices seen this week\nRussians brace for sanctions as their favorite shops close\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nNew plant species in Albay named after late biologist\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nDuterte uses up intel, contingency funds\n\n\n\n\n\n\nDespite being in the industry for 10 years, Grammy-winning producer Dem Jointz says he’s just getting started\n\n\n\n\n\n\nChina ship ‘shadowing’ research vessel in WPS\n\n\n\n\n\n\nHonolulu Café is the cure for your Egg Tarts and Roastings cravings\n\n\n\n\n\n\nDOH: Daily COVID count hits plateau\u2028\n\n\n\n\n\n\nTorre Lorenzo offers a worry-free investment opportunity in Ascott-managed premium serviced residences\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\n‘Isko’s withdrawal will hurt Leni’\n\n\n\n\n\n\nFilipino woman found dead in a suitcase\n\n\n\n\n\n\n7k attend Marcos rally in Catarman\n\n\n\n\n\n\nGov’t places more areas under COVID-19 Alert Level 1 from April 9-15\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Metro Cebu power rates\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."},"22":{"Title":"New plant species in Albay named after late biologist","Author":"Ma. April Mier-Manjares","Publication Date":"April 04, 2022","Content":"CONSERVATIONIST The late biology teacher and conservationist Francis Gregor Abuid, whom a newly discovered begonia species in Albay is named after, dedicated his young life to advocating the protection of biodiversity in the Bicol region and teaching young biologists. —PHOTO COURTESY OF CARL JOSEF ABUID\nLEGAZPI CITY, Albay, Philippines — An endemic plant species was discovered in Albay province and was named after the late Francis Gregor Abuid, a conservation biologist, for his efforts in protecting the rich biodiversity of the Bicol region.\nThe new species was named Begonia francisabuidii after the 25-year-old high school biology teacher who died in a vehicular accident in 2021.\nADVERTISEMENT\n\n\n\n\n\n\nThe new begonia species is similar to Begonia madulidii but it is distinguished by shorter and puberulent rhizomes, densely hirsute stipules, reddish and pubescent petiole, smaller leaves, puberulous panicle, smaller bracts and four-tepaled pistillate flower, according to a research published by Taiwania International Journal of Biodiversity on March 28.\nResearch author Cyrus Job dela Cruz said the species resembled the personality of Abuid, as he always wanted to travel far to explore new places riding his bicycle.FEATURED STORIES\nNEWSINFO\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\nNEWSINFO\nUP Law’s first magna cum laude in over a decade stays grounded\n\nNEWSINFO\nTwo Marcos groups in the Visayas switch to Isko Moreno\n\n“We discovered B. francisabuidii in a peaceful and far-flung area [in Albay]. It was so inspiring to name it after him because his level of determination to conquer every struggle was the same as when we were looking for francisabuidii,” he said.\nDela Cruz said the white flowers that bloomed from the B. francisabuidii species were as “pure as [the] heart and dedication” of Abuid to “inspire young learners to guard and conserve the biodiversity” of the region.\n\n\n\n\n“The white flower represents his kind heart for young researchers who asked help from him for school-related work. He used to accompany these students from sampling to writing research papers,” he said.\nCritically endangered\nThe research was a collaborative work of Dela Cruz and his coauthors Steven Concepcion from Bicol University and Yu Pin Ang from Philippine Taxonomic Initiative Inc.\nDela Cruz is a field biologist of the Department of Environment and Natural Resources (DENR) Bicol and is currently taking a Master of Science in Biodiversity and Environmental Management at Bicol University graduate school in Legazpi City.\nThe species was discovered near Nahulugang-Patok Falls in Barangay Oma-Oma, an upland village in Ligao City.\nB. francisabuidii is lithophytic and assumed to be highly dependent on moisture. Its flowers bloom during the months of September and November.\nADVERTISEMENT\n\n\n\n\n\n\nDela Cruz said they considered it critically endangered because of its short dispersal and that they remained isolated in far-flung areas.\n“We searched the area for the presence of the population, they were observed growing only in moist shaded rocks near the waterfall. I also can’t find the same in some other areas in Albay,” he said.\nThe species’ population is vulnerable and at risk of decline as the site is frequently visited by local tourists and there is an increase in anthropogenic activities, or environmental damage caused by human activity, added Dela Cruz.\nRARE BLOOM Begonia francisabuidii, named after Abuid, is a new plant species discovered in Ligao City, Albay province. —PHOTO COURTESY OF CYRUS JOB DELA CRUZ\nHe also cited that the area is not currently protected under the country’s Expanded National Integrated Protected Areas System by the DENR.\n“We need to protect this species because it is very unique, it can be considered as a bioindicator. The exploitation of the area could destroy begonia, thus, the possibility of affecting the food chain or food web,” he added.\nThe researcher hoped that the recent discovery would encourage the younger generations to study biodiversity and guard the natural environment.\nLiving memory\nCarl Josef, brother of Abuid, said they were surprised and honored that one of the dreams of his brother was achieved through his genuine friends.\n“Even though he is gone, it makes me feel like there’s a piece of him on earth that lives among us and it gives us more reason to remember him and to celebrate the life he lived,” he said.\nHe said his brother loved outdoor activities, researching about conservation of animals and plants, and dreamed of being featured in wildlife-related magazines and television programs.\nThe late biologist’s mother, Francia, said she would want to grow the same species at her son’s grave in Guinobatan town.\n\n \n“He may be gone physically but his memory lives in the plants. We are thankful to his friends for naming it after him,” she said.\nRELATED STORY\nNew flowering plant grows on Mt. Arayat\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead Next\n\n\n\n\n\n\n\n\nPrexy bets offer plans for renewable energy, water supply\n\n\n\n\n \n\n\n\nEDITORS' PICK\n\n\n\n\n\n\n\nSurprised: Agaton flooding sends Capiz residents to rooftops\n\n\n\n\n\n\nAround 59K cops deployed to various transport terminals for Holy Week\n\n\n\n\n\n\nFair weather over PH on April 14, Maundy Thursday – Pagasa\n\n\n\n\n\n\nMahal ang gas? Register to www.toktokgo.ph to get P500 daily fuel subsidy\n\n\n\n\n\n\nTECNO Mobile gives the power of POVA Neo to local community heroes\n\n\n\n\n\n\nMetro Pacific Investments Corporation Notice of Annual Shareholders’ Meeting 2 of 2\n\n\n\n\n\n\nMOST READ\n\n\n\n\n\n\n\nRobredo gets backing of more celebs; influencers snubbed during house-to-house drive\n\n\n\n\n\n\nKC Concepcion replaces Toni Gonzaga as lead actress in New York film\n\n\n\n\n\n\nTwo Marcos groups in the Visayas switch to Isko Moreno\n\n\n\n\n\n\nRobredo gains converts, Marcos is Cebu party’s pick\n\n\n\n\n\n\nDon't miss out on the latest news and information.   \n\n\n\nView comments\n\n\n\n\nSubscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.\n\nTAGS: Begonia francisabuidii, Francis Gregor Abuid, new plant species\n\n\n\n\nFor feedback, complaints, or inquiries, contact us."}}